Revit 2026 API

# CADExportOptions Class

---

Generic CAD Export options.

SystemObject Autodesk.Revit.DBCADExportOptions Autodesk.Revit.DBDWFExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CADExportOptions
```
```vb
Public MustInherit Class CADExportOptions
```
```cpp
public ref class CADExportOptions abstract
```
```fsharp
[<AbstractClassAttribute>]
type CADExportOptions = class end
```

The CADExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace